benchmark_report/wrk_results_6776/wrk_1000concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   109.32ms  280.16ms   1.92s    89.34%
    Req/Sec     1.06k   600.25     2.66k    59.13%
  Latency Distribution
     50%   10.67ms
     75%   12.03ms
     90%  450.86ms
     99%    1.28s 
  26563 requests in 2.12s, 2.43MB read
  Socket errors: connect 0, read 0, write 0, timeout 16
Requests/sec:  12511.29
Transfer/sec:      1.15MB