benchmark_report/wrk_results_6776/wrk_100concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    50.02ms  215.53ms   1.73s    95.87%
    Req/Sec     0.97k    71.38     1.22k    88.23%
  Latency Distribution
     50%    8.28ms
     75%    9.17ms
     90%    9.99ms
     99%    1.38s 
  350946 requests in 31.81s, 32.13MB read
Requests/sec:  11033.56
Transfer/sec:      1.01MB