benchmark_report/wrk_results_6776/wrk_200concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   120.50ms  253.77ms   1.85s    86.45%
    Req/Sec     0.98k   170.52     1.52k    67.17%
  Latency Distribution
     50%   11.60ms
     75%   13.36ms
     90%  552.84ms
     99%    1.00s 
  351018 requests in 30.03s, 32.14MB read
  Socket errors: connect 0, read 0, write 0, timeout 83
Requests/sec:  11688.81
Transfer/sec:      1.07MB