benchmark_report/wrk_results_6776/wrk_400concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   189.07ms  317.41ms   1.90s    82.46%
    Req/Sec     0.98k   277.46     2.67k    71.94%
  Latency Distribution
     50%   12.10ms
     75%  248.60ms
     90%  760.14ms
     99%    1.14s 
  350691 requests in 30.07s, 32.11MB read
  Socket errors: connect 0, read 0, write 0, timeout 731
Requests/sec:  11661.22
Transfer/sec:      1.07MB