benchmark_report/wrk_results_6776/wrk_600concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 600 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   178.43ms  333.46ms   1.93s    84.05%
    Req/Sec     1.02k   421.41     3.34k    79.70%
  Latency Distribution
     50%   11.55ms
     75%  130.48ms
     90%  764.41ms
     99%    1.29s 
  75460 requests in 6.36s, 6.91MB read
  Socket errors: connect 0, read 0, write 0, timeout 256
Requests/sec:  11863.82
Transfer/sec:      1.09MB