benchmark_report/wrk_results_6776/wrk_800concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    95.06ms  256.07ms   1.88s    90.24%
    Req/Sec     1.02k   421.35     2.53k    66.92%
  Latency Distribution
     50%   11.02ms
     75%   12.53ms
     90%  308.85ms
     99%    1.24s 
  40613 requests in 3.34s, 3.72MB read
  Socket errors: connect 0, read 0, write 0, timeout 151
Requests/sec:  12165.84
Transfer/sec:      1.11MB